Tekla.Structures.Model.Events
The Events class allows the user to register event listeners for model events.
Remarks:
Asynchronous event handling
Registered event handlers are called asynchronously so that many handlers may be running
simultaneously. Event handlers are not guaranteed to be run in the same thread where they were registered.
The asynchronous nature of the events requires the use of synchronization constructs on objects
and data structures that are not defined to be thread safe.
Microsoft's documentation about the lock statement: http://msdn.microsoft.com/en-us/library/c5kehkcz.aspx
Microsoft's documentation about delegates: http://msdn.microsoft.com/en-us/library/900fyy8e.aspx
Microsoft's documentation about managed threading: http://msdn.microsoft.com/en-us/library/1c9txz50.aspx
The following example shows how to make sure that only one selection event handler is running at a time.
using Tekla.Structures.Model;
public class Example
{
private Tekla.Structures.Model.Events _events = new Tekla.Structures.Model.Events();
private object _selectionEventHandlerLock = new object();
public void RegisterEventHandler()
{
_events.SelectionChange += Events_SelectionChangeEvent;
_events.Register();
}
public void UnRegisterEventHandler()
{
_events.UnRegister();
}
void Events_SelectionChangeEvent()
{
/* Make sure that the inner code block is running synchronously */
lock(_selectionEventHandlerLock)
{
System.Console.WriteLine("Selection changed event received.");
}
}
}